podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC13xx.svd.xml
            <register>
               <name>SYSRESSTAT</name>
               <description>System reset status register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>POR reset status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_POR_DETECTED</name>
                           <description>No POR detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POR_DETECTED</name>
                           <description>POR detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>Status of the external RESET pin</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESET_EVENT_DETEC</name>
                           <description>No RESET event detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET_DETECTED</name>
                           <description>RESET detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Status of the Watchdog reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_WDT_RESET_DETECTE</name>
                           <description>No WDT reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_RESET_DETECTED</name>
                           <description>WDT reset detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOD</name>
                     <description>Status of the Brown-out detect reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BOD_RESET_DETECTE</name>
                           <description>No BOD reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOD_RESET_DETECTED</name>
                           <description>BOD reset detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRST</name>
                     <description>Status of the software system reset. The ARM software reset has the same effect as the hardware reset using the  RESET pin</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_SYSTEM_RESET_DETE</name>
                           <description>No System reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_RESET_DETECTE</name>
                           <description>System reset detected</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKSEL</name>
               <description>System PLL clock source select</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>System PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKUEN</name>
               <description>System PLL clock source update enable</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable system PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBPLLCLKSEL</name>
               <description>USB PLL clock source select</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>USB PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_THE_USB_PLL_CLO</name>
                           <description>IRC. The USB PLL clock source must be switched to system oscillator for correct USB operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBPLLCLKUEN</name>
               <description>USB PLL clock source update enable</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable USB PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKSEL</name>
               <description>Main clock source select</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Clock source for main clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_CLOCK_TO_SYSTE</name>
                           <description>Input clock to system PLL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_OSCILLATOR</name>
                           <description>WDT oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_PLL_CLOCK_OUT</name>
                           <description>System PLL clock out</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKUEN</name>
               <description>Main clock source update enable</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable main clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKDIV</name>
               <description>System AHB clock divider</description>
               <addressOffset>0x78</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKCTRL</name>
               <description>System AHB clock control</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0x485F</resetValue>
               <fields>
                  <field>
                     <name>SYS</name>
                     <description>Enables clock for AHB to APB bridge, to the AHB matrix, to the Cortex-M3 FCLK and HCLK, to the SysCon, and to the PMU. This bit is read only</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>Enables clock for ROM</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ROM" > <name>RAM</name> <description>Enables clock for RAM</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASHREG</name> <description>Enables clock for flash register interface</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASHARRAY</name> <description>Enables clock for flash array access</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C</name> <description>Enables clock for I2C</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GPIO</name> <description>Enables clock for GPIO</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B0</name> <description>Enables clock for 16-bit counter/timer 0</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B1</name> <description>Enables clock for 16-bit counter/timer 1</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B0</name> <description>Enables clock for 32-bit counter/timer 0</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B1</name> <description>Enables clock for 32-bit counter/timer 1</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SSP</name> <description>Enables clock for SSP</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>UART</name> <description>Enables clock for UART. Note that the UART pins must be configured in the IOCON block before the UART clock can be enabled</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>ADC</name> <description>Enables clock for ADC</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>USB_REG</name> <description>Enables clock for USB_REG</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>WDT</name> <description>Enables clock for WDT</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>IOCON</name> <description>Enables clock for IO configuration block</description> <bitOffset>16</bitOffset> </field>
                  <field>
                     <name>SSP1</name>
                     <description>Enables clock for SPISP1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSP0CLKDIV</name>
               <description>SSP clock divder</description>
               <addressOffset>0x94</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SSP_PCLK clock divider values. 0: Disable SSP0_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKDIV</name>
               <description>UART clock divder</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSP1CLKDIV</name>
               <description>SPISP1 clock divder</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SSP1_PCLK clock divider values 0: Disable SSP1_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRACECLKDIV</name>
               <description>ARM trace clock divider</description>
               <addressOffset>0xAC</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>ARM trace clock divider values. 0: Disable TRACE_CLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSTICKCLKDIV</name>
               <description>SYSTICK clock divder</description>
               <addressOffset>0xB0</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SYSTICK clock divider values. 0: Disable SYSTICK timer clock.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKSEL</name>
               <description>USB clock source select</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>USB clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_PLL_OUT</name>
                           <description>USB PLL out</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
