podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC13xx.svd.xml
            <register>
               <name>USBCLKUEN</name>
               <description>USB clock source update enable</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable USB clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update
clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKDIV</name>
               <description>USB clock source divider</description>
               <addressOffset>0xC8</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>USB clock divider values. 0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKSEL</name>
               <description>WDT clock source select</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>WDT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKUEN</name>
               <description>WDT clock source update enable</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable WDT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKDIV</name>
               <description>WDT clock divider</description>
               <addressOffset>0xD8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>WDT clock divider values. 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTCLKSEL</name>
               <description>CLKOUT clock source select</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>CLKOUT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTUEN</name>
               <description>CLKOUT clock source update enable</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable CLKOUT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTDIV</name>
               <description>CLKOUT clock divider</description>
               <addressOffset>0xE8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Clock divider values. 0: Disable CLKOUT.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP0</name>
               <description>POR captured PIO status 0</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPPIO0_0</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_1</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_2</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_3</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_4</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_5</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_6</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_7</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_8</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_9</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_10</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO0_11</name>
                     <description>Raw reset status input PIO0_11 to PIO0_0</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_0</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_1</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_2</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_3</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_4</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_5</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_6</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_7</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_8</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_9</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_10</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_11</name>
                     <description>Raw reset status input PIO1_11 to PIO1_0</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_0</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_1</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_2</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_3</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_4</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_5</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_6</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_7</name>
                     <description>Raw reset status input PIO2_7 to PIO2_0</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP1</name>
               <description>POR captured PIO status 1</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPPIO2_8</name>
                     <description>Raw reset status input PIO2_8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_9</name>
                     <description>Raw reset status input PIO2_9</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_10</name>
                     <description>Raw reset status input PIO2_10</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_11</name>
                     <description>Raw reset status input PIO2_11</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_0</name>
                     <description>Raw reset status input PIO3_0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_1</name>
                     <description>Raw reset status input PIO3_1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_2</name>
                     <description>Raw reset status input PIO3_2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_3</name>
                     <description>Raw reset status input PIO3_3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_4</name>
                     <description>Raw reset status input PIO3_4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_5</name>
                     <description>Raw reset status input PIO3_5</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
