podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC13xx.svd.xml
            <register>
               <name>STARTSRP1</name>
               <description>Start logic status register 1; top 8 interrupts</description>
               <addressOffset>0x21C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SRPIO2_8</name>
                     <description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO2_9</name>
                     <description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO2_10</name>
                     <description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO2_11</name>
                     <description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO3_0</name>
                     <description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO3_1</name>
                     <description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO3_2</name>
                     <description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRPIO3_3</name>
                     <description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSLEEPCFG</name>
               <description>Power-down states in Deep-sleep mode</description>
               <addressOffset>0x230</addressOffset>
               <fields>
                  <field>
                     <name>FIXEDVAL0</name>
                     <description>Reserved. Always write these bits as 111</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BOD_PD</name>
                     <description>BOD power-down control in Deep-sleep mode, see Table 49</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXEDVAL1</name>
                     <description>Reserved. Always write these bits as 11</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field derivedFrom="BOD_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power control in Deep-sleep mode, see Table 49</description> <bitOffset>6</bitOffset> </field>
                  <field>
                     <name>FIXEDVAL2</name>
                     <description>Reserved. Always write these bits as 11111</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDAWAKECFG</name>
               <description>Power-down states after wake-up from Deep-sleep mode</description>
               <addressOffset>0x234</addressOffset>
               <resetValue>0xFDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output wake-up configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power-down wake-up configuration</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash wake-up configuration</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD wake-up configuration</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC wake-up configuration</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>System oscillator wake-up configuration</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator wake-up configuration</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL wake-up configuration</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>USBPLL_PD</name> <description>USB PLL wake-up configuration</description> <bitOffset>8</bitOffset> </field>
                  <field>
                     <name>FIXEDVAL0</name>
                     <description>Reserved. Always write this bit as 0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBPAD_PD</name>
                     <description>USB pad wake-up configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_PHY_POWERED</name>
                           <description>USB PHY powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USB_PHY_POWERED_DOWN</name>
                           <description>USB PHY powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXEDVAL1</name>
                     <description>Reserved. Always write this bit as 1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIXEDVAL2</name>
                     <description>Reserved. Always write this bit as 0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIXEDVAL3</name>
                     <description>Reserved. Always write these bits as 111</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDRUNCFG</name>
               <description>Power-down configuration register</description>
               <addressOffset>0x238</addressOffset>
               <resetValue>0xFDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output power-down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power-down</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash power-down</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD power-down</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC power-down</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>System oscillator power-down[1]</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power-down</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL power-down</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>USBPLL_PD</name> <description>USB PLL power-down</description> <bitOffset>8</bitOffset> </field>
                  <field>
                     <name>FIXEDVAL0</name>
                     <description>Reserved. Always write this bit as 0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBPAD_PD</name>
                     <description>USB pad power-down configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_PHY_POWERED</name>
                           <description>USB PHY powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USB_PHY_POWERED_DOWN</name>
                           <description>USB PHY powered down (suspend mode)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXEDVAL1</name>
                     <description>Reserved. Always write this bit as 1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICE_ID</name>
               <description>Device ID</description>
               <addressOffset>0x3F4</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DEVICEID</name>
                     <description>Device ID for LPC13xx parts: 0x2C42 502B = LPC1311FHN33 
								0x2C40 102B = LPC1313FHN33 
								0x2C40 102B = LPC1313FBD48 
								0x3D01 402B = LPC1342FHN33 
								0x3D00 002B = LPC1343FHN33 
								0x3D00 002B = LPC1343FBD48 
								0x1816 902B = LPC1311FHN33/01 
								0x1830 102B = LPC1313FHN33/01 
								0x1830 102B = LPC1313FBD48/01</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
